cgi-bin/PDG_Commerce/AdminTemplates/PayPalCheckoutGetDetials.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/1999/XMLSchema" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
   <SOAP-ENV:Header>
      <RequesterCredentials xmlns="urn:ebay:api:PayPalAPI" SOAP-ENV:mustUnderstand="1">
         <Credentials xmlns="urn:ebay:apis:eBLBaseComponents">
            <Username></Username>
            <Password></Password>
            <Subject/>
         </Credentials>
      </RequesterCredentials>
   </SOAP-ENV:Header>
   <SOAP-ENV:Body>
      <GetExpressCheckoutDetailsReq xmlns="urn:ebay:api:PayPalAPI">
         <GetExpressCheckoutDetailsRequest xsi:type="ns:SetExpressCheckoutRequestType">
            <Version xmlns="urn:ebay:apis:eBLBaseComponents" xsi:type="xsd:string" >1.0</Version>
            <Token></Token>
         </GetExpressCheckoutDetailsRequest>
      </GetExpressCheckoutDetailsReq>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>